# 应用程序文本内容配置

# 广告位文本
ADVERTISEMENT_TEXT = """
如果觉得好用\n请给项目点个star，谢谢！\n\n

吸烟有害健康，请注意个人健康。
"""

# 使用说明文本
HELP_TEXT = """使用说明：

反正写了也没人看，我删了，直接点左上角的帮助、帮助中心吧，如果不能访问，那加群交流或者自行研究。

另外，使用第三方直播工具如OBS，会有封号、直播封禁的风险。这里推荐能用官方直播工具的情况下请用官方直播工具。
"""

# OBS使用说明文本
OBS_HELP_TEXT = """OBS管理面板使用说明：

1. OBS路径配置
   · 点击后选择OBS安装目录下的obs64.exe文件
   · 配置成功后状态会显示"已配置"

2. 推流配置
   · 点击后选择OBS配置文件夹中的service.json文件
   · 文件位置：
     用户目录/AppData/Roaming/obs-studio/basic/profiles/
   · 一般只有一个文件夹，多个的情况下请自行区分，点进去以后
      选择service.json文件
   · 配置成功后状态会显示"已配置"

3. 同步推流码
   · 需要先完成OBS路径配置
   · 点击后会自动同步推流码到OBS配置文件中

4. 启动OBS
   · 需要先完成OBS路径配置
   · 点击后会自动启动OBS程序
   · 已经获取推流码的情况下会自动进行同步推流码

5. 插件管理
   · 点击后会打开插件管理面板
   · 仅可安装和卸载插件列表所支持插件
   · 一般采用压缩包形式安装，安装后需重启obs
   · 如果有好用的插件，可以进群里反馈，加到列表中
   · 不会使用的话，请加群与群友自行交流讨论
   · to插件作者：如果不喜欢自己的插件在列表中，可以联系删除

6. 注意事项
   · 首次使用请先配置OBS路径
   · 确保OBS已正确安装并运行过
   · 所有配置会自动保存，下次启动软件时自动加载
   
   """
